OpenFoam Tutorials/inner Flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          606;
        startFace       109755;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       110361;
    }
    walls
    {
        type            wall;
        nFaces          6504;
        startFace       110861;
    }
)

// ************************************************************************* //
